app/controllers/dojos_controller.rb

  def index
    @dojos = Dojo.all
---
SELECT * FROM `dojos`

  def show
    @dojo = Dojo.find(params[:id])
---
SELECT * FROM `dojos` WHERE (`dojos`.`id` = 1)

  def create
    @dojo = Dojo.new(params[:dojo])

    if @dojo.save
---
INSERT INTO `dojos` (`name`, `created_at`, `updated_at`, `time`) VALUES('DojoRN', '2010-08-12 03:24:05', '2010-08-12 03:24:05', 5)

  def edit
    @dojo = Dojo.find(params[:id])
---
SELECT * FROM `dojos` WHERE (`dojos`.`id` = 1)